fio-test/results/crazns_numjobs_2/64k_14-1.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=64
...
fio-3.28
Starting 14 processes

job1: (groupid=0, jobs=14): err= 0: pid=30826: Mon Sep 16 16:05:22 2024
  write: IOPS=25.9k, BW=1620MiB/s (1698MB/s)(1178GiB/744718msec); 0 zone resets
    clat (usec): min=71, max=7424, avg=531.21, stdev=90.21
     lat (usec): min=73, max=7426, avg=534.97, stdev=90.55
    clat percentiles (usec):
     |  1.00th=[  379],  5.00th=[  408], 10.00th=[  429], 20.00th=[  474],
     | 30.00th=[  502], 40.00th=[  523], 50.00th=[  529], 60.00th=[  545],
     | 70.00th=[  553], 80.00th=[  578], 90.00th=[  611], 95.00th=[  635],
     | 99.00th=[  857], 99.50th=[ 1139], 99.90th=[ 1237], 99.95th=[ 1287],
     | 99.99th=[ 1729]
   bw (  MiB/s): min= 1340, max= 2469, per=100.00%, avg=1624.21, stdev= 9.08, samples=20794
   iops        : min=21453, max=39516, avg=25985.28, stdev=145.33, samples=20794
  lat (usec)   : 100=0.01%, 250=0.06%, 500=29.14%, 750=69.35%, 1000=0.73%
  lat (msec)   : 2=0.72%, 4=0.01%, 10=0.01%
  cpu          : usr=2.12%, sys=4.59%, ctx=19300241, majf=0, minf=233
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19299840,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=1620MiB/s (1698MB/s), 1620MiB/s-1620MiB/s (1698MB/s-1698MB/s), io=1178GiB (1265GB), run=744718-744718msec

Disk stats (read/write):
    dm-0: ios=48/19298962, merge=0/0, ticks=4/9299700, in_queue=9299704, util=100.00%, aggrios=11/3859968, aggrmerge=0/0, aggrticks=0/167738, aggrin_queue=167739, aggrutil=100.00%
  nvme0n1: ios=0/2894976, merge=0/0, ticks=0/130850, in_queue=130850, util=100.00%
  nvme3n1: ios=0/2894976, merge=0/0, ticks=0/133567, in_queue=133567, util=100.00%
  nvme1n2: ios=26/4824960, merge=0/0, ticks=2/202341, in_queue=202343, util=100.00%
  nvme4n2: ios=12/4824960, merge=0/0, ticks=1/198976, in_queue=198977, util=100.00%
  nvme2n1: ios=0/2894976, merge=0/0, ticks=0/134177, in_queue=134178, util=100.00%
  nvme0n2: ios=36/4824960, merge=0/0, ticks=2/202555, in_queue=202557, util=100.00%
  nvme3n2: ios=18/4824960, merge=0/0, ticks=2/204580, in_queue=204583, util=100.00%
  nvme1n1: ios=0/2894976, merge=0/0, ticks=0/130999, in_queue=130999, util=100.00%
  nvme4n1: ios=0/2894976, merge=0/0, ticks=0/132502, in_queue=132502, util=100.00%
  nvme2n2: ios=20/4824960, merge=0/0, ticks=2/206834, in_queue=206836, util=100.00%